#+TITLE: Plan for Virtual Labs Analytics Service
#+AUTHOR: VLEAD
#+DATE: [2017-09-11 Mon]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  This document contains the realization plan for
  implementing the vlabs-analytics-service. This application
  is realized as series of [[https://github.com/vlead/vlabs-analytics-service/milestones?state=closed][milestones]].


* Milestones Snapshot
  |---+----+----+-----+----------------------------------+------+--------+-----+-----+--------|
  |   | S. | Mi | Req | Milestone                        | Plan | Status | Est | Act | Issues |
  |   | no | no | Map |                                  |      |        | hrs | hrs |        |
  |---+----+----+-----+----------------------------------+------+--------+-----+-----+--------|
  |   |  1 | [[https://github.com/vlead/analytics-db/milestone/3][2]]  |     | [[https://github.com/vlead/vlabs-analytics-service/milestone/1][Release of v0.0.1]]                |      | Open   | 203 | 218 | [[https://github.com/vlead/vlabs-analytics-servicea/milestones/Release%20of%20v0.0.1%20on%20staging%20environment][ref]]    |
  |---+----+----+-----+----------------------------------+------+--------+-----+-----+--------|
  |   |  2 | [[https://github.com/vlead/analytics-db/milestone/1][1]]  |     | [[https://github.com/vlead/vlabs-analytics-service/milestone/1][Implement REST API(s) interfaces]] |      | Closed | 203 | 218 | [[https://github.com/vlead/vlabs-analytics-service/milestones/Implement%2520REST%2520API%2528s%2529%2520interfaces][ref]]    |
  |---+----+----+-----+----------------------------------+------+--------+-----+-----+--------|
  |   |    |    |     | Total                            |      |        | 406 | 218 |        |
  | ^ |    |    |     |                                  |      |        |  et |  at |        |
  |---+----+----+-----+----------------------------------+------+--------+-----+-----+--------|
  #+TBLFM: $2=@#-2
  #+TBLFM: @3$8=remote(tbl-realization-plan-1, $est)
  #+TBLFM: @3$9=remote(tbl-realization-plan-1, $act)
  #+TBLFM: $et=vsum(@II+1..@-1)
  #+TBLFM: $at=vsum(@II+1..@-1)

* Detailed Plan 
** Implement REST API(s) interfaces  
   This [[https://github.com/vlead/vlabs-analytics-service/milestone/1][milestone]] includes the following features:

  1) APIs will be available to store/retrieve the usage
     analytics of labs hosted on Openedx and college cloud
     edition
  2) APIs to store/retrieve the user analytics of Openedx
     platform
  4) APTs to store feedback analytics of vlabs and college
     cloud platform
  #+caption:  realization-plan
  #+name: tbl-realization-plan-1
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  S. | Tasks                          | Github |    Est |    Act |        Est |        Act | Status      | Assignee |
|   |  NO |                                | Issues | Effort | Effort |     Start/ |     Start, |             |          |
|   |     |                                |        |    (in |    (in |        End |        End |             |          |
|   |     |                                |        | person | person |      Dates |      Dates |             |          |
|   |     |                                |        | hours) | hours) |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  1. | Document steps                 | [[https://github.com/vlead/vlabs-analytics-service/issues/15][15]]     |     12 |     12 | 12-09-2017 | 12-09-2017 | Done        | Sripathi |
|   |     | to configure                   |        |        |        | 13-09-2017 | 13-09-2017 |             |          |
|   |     | logstash service on            |        |        |        |            |            |             |          |
|   |     | production                     |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  2. | Compute total lab usage        | [[https://github.com/vlead/vlabs-analytics-service/issues/12][12]]     |     16 |     10 | 13-09-2017 | 12-09-2017 | Done        | Sripathi |
|   |     | of non-openedx platform        |        |        |        | 13-09-2017 | 12-09-2017 |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  3. | Compute lab wise usage         | [[https://github.com/vlead/vlabs-analytics-service/issues/11][11]]     |     10 |      6 | 01-09-2017 | 01-09-2017 | Done        | Sripathi |
|   |     | for non-openedx platform       |        |        |        | 13-09-2017 | 13-09-2017 |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  4. | Design API to find out         | [[https://github.com/vlead/vlabs-analytics-service/issues/10][#10]]    |     36 |     40 | 12-09-2017 | 12-09-2017 | Done        | Sripathi |
|   |     | current number of logged       |        |        |        | 13-09-2017 | 12-09-2017 |             |          |
|   |     | in &registered users           |        |        |        |            |            |             |          |
|   |     | in vlabs.ac.in                 |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  5. | Compute lab wise usage         | [[https://github.com/vlead/vlabs-analytics-service/issues/9][#9]]     |     24 |     30 | 12-09-2017 | 12-09-2017 | Done        | Sripathi |
|   |     | for labs running on open-edx   |        |        |        | 13-09-2017 | 13-09-2017 |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  6. | Design modular API to get      | [[https://github.com/vlead/vlabs-analytics-service/issues/9][#22]]    |     32 |     40 | 15-09-2017 |            | Done        | Sripathi |
|   |     | usage by given lab_id,         |        |        |        | 19-09-2017 |            |             |          |
|   |     | institute_id, discipline_id    |        |        |        |            |            |             |          |
|   |     | or date                        |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  7. | Design modular API to get      | [[https://github.com/vlead/vlabs-analytics-service/issues/24][#24]]    |     32 |     40 | 19-09-2017 |            | Done        | Sripathi |
|   |     | top 'n' number of labs by      |        |        |        | 20-09-2017 |            |             |          |
|   |     | given discipline, institute    |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  8. | Design API to get Outreach     | [[https://github.com/vlead/vlabs-analytics-service/issues/23][#23]]    |      6 |      0 | 19-09-2017 |            | Not started | Sripathi |
|   |     | Portal user analytics          |        |        |        | 20-09-2017 |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  9. | Implement all possible         | [[https://github.com/vlead/vlabs-analytics-service/issues/34][#34]]    |     32 |     40 | 26-09-2017 |            | In progress | Sripathi |
|   |     | negative & positive test cases |        |        |        | 27-09-2017 |            |             |          |
|   |     | for the analytics APIs         |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   | 10. | Document what all queries      | [[https://github.com/vlead/vlabs-analytics-service/issues/35][#35]]    |      3 |      0 | 26-09-2017 |            | In progress | Sripathi |
|   |     | used to obtain usage           |        |        |        | 27-09-2017 |            |             |          |
|   |     | analytics from analytics-db    |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |     |                                |        |    203 |    218 |            |            |             |          |
| ^ |     |                                |        |    est |    act |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
 #+TBLFM: $est=vsum(@II+1..@-1)
 #+TBLFM: $act=vsum(@II+1..@-1)

** Release of v0.0.1
   This [[https://github.com/vlead/vlabs-analytics-service/milestone/3][milestone]] includes the following features:

  1) Deployment of service on staging environment

  #+caption:  realization-plan
  #+name: tbl-realization-plan-2
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  S. | Tasks                          | Github |    Est |    Act |        Est |        Act | Status      | Assignee |
|   |  NO |                                | Issues | Effort | Effort |     Start/ |     Start, |             |          |
|   |     |                                |        |    (in |    (in |        End |        End |             |          |
|   |     |                                |        | person | person |      Dates |      Dates |             |          |
|   |     |                                |        | hours) | hours) |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  1. | Document steps                 | [[https://github.com/vlead/vlabs-analytics-service/issues/15][15]]     |     12 |     12 | 12-09-2017 | 12-09-2017 | Done        | Sripathi |
|   |     | to configure                   |        |        |        | 13-09-2017 | 13-09-2017 |             |          |
|   |     | logstash service on            |        |        |        |            |            |             |          |
|   |     | production                     |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  2. | Compute total lab usage        | [[https://github.com/vlead/vlabs-analytics-service/issues/12][12]]     |     16 |     10 | 13-09-2017 | 12-09-2017 | Done        | Sripathi |
|   |     | of non-openedx platform        |        |        |        | 13-09-2017 | 12-09-2017 |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  3. | Compute lab wise usage         | [[https://github.com/vlead/vlabs-analytics-service/issues/11][11]]     |     10 |      6 | 01-09-2017 | 01-09-2017 | Done        | Sripathi |
|   |     | for non-openedx platform       |        |        |        | 13-09-2017 | 13-09-2017 |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  4. | Design API to find out         | [[https://github.com/vlead/vlabs-analytics-service/issues/10][#10]]    |     36 |     40 | 12-09-2017 | 12-09-2017 | Done        | Sripathi |
|   |     | current number of logged       |        |        |        | 13-09-2017 | 12-09-2017 |             |          |
|   |     | in &registered users           |        |        |        |            |            |             |          |
|   |     | in vlabs.ac.in                 |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  5. | Compute lab wise usage         | [[https://github.com/vlead/vlabs-analytics-service/issues/9][#9]]     |     24 |     30 | 12-09-2017 | 12-09-2017 | Done        | Sripathi |
|   |     | for labs running on open-edx   |        |        |        | 13-09-2017 | 13-09-2017 |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  6. | Design modular API to get      | [[https://github.com/vlead/vlabs-analytics-service/issues/9][#22]]    |     32 |     40 | 15-09-2017 |            | Done        | Sripathi |
|   |     | usage by given lab_id,         |        |        |        | 19-09-2017 |            |             |          |
|   |     | institute_id, discipline_id    |        |        |        |            |            |             |          |
|   |     | or date                        |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  7. | Design modular API to get      | [[https://github.com/vlead/vlabs-analytics-service/issues/24][#24]]    |     32 |     40 | 19-09-2017 |            | Done        | Sripathi |
|   |     | top 'n' number of labs by      |        |        |        | 20-09-2017 |            |             |          |
|   |     | given discipline, institute    |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  8. | Design API to get Outreach     | [[https://github.com/vlead/vlabs-analytics-service/issues/23][#23]]    |      6 |      0 | 19-09-2017 |            | Not started | Sripathi |
|   |     | Portal user analytics          |        |        |        | 20-09-2017 |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |  9. | Implement all possible         | [[https://github.com/vlead/vlabs-analytics-service/issues/34][#34]]    |     32 |     40 | 26-09-2017 |            | In progress | Sripathi |
|   |     | negative & positive test cases |        |        |        | 27-09-2017 |            |             |          |
|   |     | for the analytics APIs         |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   | 10. | Document what all queries      | [[https://github.com/vlead/vlabs-analytics-service/issues/35][#35]]    |      3 |      0 | 26-09-2017 |            | In progress | Sripathi |
|   |     | used to obtain usage           |        |        |        | 27-09-2017 |            |             |          |
|   |     | analytics from analytics-db    |        |        |        |            |            |             |          |
|   |     |                                |        |        |        |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
|   |     |                                |        |    203 |    218 |            |            |             |          |
| ^ |     |                                |        |    est |    act |            |            |             |          |
|---+-----+--------------------------------+--------+--------+--------+------------+------------+-------------+----------|
 #+TBLFM: $est=vsum(@II+1..@-1)
 #+TBLFM: $act=vsum(@II+1..@-1)

